var activeCities = [
    // Дальневосточный федеральный округ
    {coords: [43.115141, 131.885341], name: 'Владивосток'},
    {coords: [48.480223, 135.071917], name: 'Хабаровск'},
    {coords: [46.959179, 142.738041], name: 'Южно-Сахалинск'},
    {coords: [42.824037, 132.892811], name: 'Находка'},
    {coords: [53.037040, 158.655918], name: 'Петропавловск-Камчатский'},
    {coords: [48.794662, 132.921736], name: 'Биробиджан'},
    {coords: [53.734033, 127.265889], name: 'Зея'},
    {coords: [50.549923, 137.007948], name: 'Комсомольск-на-Амуре'},
    
    // Сибирский федеральный округ
    {coords: [52.286387, 104.280660], name: 'Иркутск'},
    {coords: [51.833507, 107.584125], name: 'Улан-Удэ'},
    {coords: [56.151362, 101.634080], name: 'Братск'},
    {coords: [52.544889, 103.888456], name: 'Ангарск'},
    {coords: [52.756648, 103.638769], name: 'Усолье-Сибирское'},
    {coords: [52.210209, 104.097395], name: 'Шелехов'},
    {coords: [57.943039, 102.741523], name: 'Усть-Илимск'},
    
    {coords: [55.030199, 82.920430], name: 'Новосибирск'},
    {coords: [53.348053, 83.779875], name: 'Барнаул'},
    {coords: [56.484680, 84.948197], name: 'Томск'},
    {coords: [55.354968, 86.087314], name: 'Кемерово'},
    {coords: [51.501196, 81.207818], name: 'Рубцовск'},
    {coords: [56.010599, 92.852545], name: 'Красноярск'},
    {coords: [53.721152, 91.442387], name: 'Абакан'},
    {coords: [53.100762, 91.412195], name: 'Саяногорск'},
    
    // Уральский федеральный округ
    {coords: [56.838607, 60.605514], name: 'Екатеринбург'},
    {coords: [55.160026, 61.402590], name: 'Челябинск'},
    {coords: [57.153033, 65.534328], name: 'Тюмень'},
    {coords: [53.407201, 58.979213], name: 'Магнитогорск'},
    {coords: [57.907605, 59.972211], name: 'Нижний Тагил'},
    {coords: [55.045671, 60.107677], name: 'Миасс'},
    {coords: [61.003180, 69.018902], name: 'Ханты-Мансийск'},
    {coords: [59.763761, 60.193493], name: 'Краснотурьинск'},
    {coords: [57.005274, 61.458114], name: 'Асбест'},
    {coords: [56.909642, 60.818128], name: 'Берёзовский'},
    {coords: [56.617744, 57.770692], name: 'Красноуфимск'},
    {coords: [56.800074, 59.908682], name: 'Ревда'},
    {coords: [59.571837, 60.791969], name: 'пос. Урай'},
    {coords: [61.314917, 63.331964], name: 'Югорск'},
    {coords: [59.935106, 60.079820], name: 'Волчанск'},
    
    // Северо-Западный федеральный округ
    {coords: [59.939095, 30.315868], name: 'Санкт-Петербург'},
    
    {coords: [54.707390, 20.507307], name: 'Калининград'},
    {coords: [55.081029, 21.888647], name: 'Советск'},
    {coords: [54.630706, 21.819503], name: 'Черняховск'},
    {coords: [54.591841, 22.201117], name: 'Гусев'},
    
    // Приволжский
    {coords: [56.326887, 44.005986], name: 'Нижний Новгород'},
    {coords: [53.195538, 50.101783], name: 'Самара'},
    {coords: [55.798551, 49.106324], name: 'Казань'},
    {coords: [54.735147, 55.958727], name: 'Уфа'},
    {coords: [56.852775, 53.211463], name: 'Ижевск'},
    {coords: [54.312416, 48.395622], name: 'Ульяновск'},
    {coords: [55.743553, 52.395820], name: 'Набережные Челны'},
    {coords: [58.603581, 49.667978], name: 'Киров'},
    {coords: [56.146247, 47.250153], name: 'Чебоксары'},
    {coords: [56.634407, 47.899878], name: 'Йошкар-Ола'},
    {coords: [55.634070, 51.809112], name: 'Нижнекамск'},
    {coords: [54.901383, 52.297113], name: 'Альметьевск'},
    {coords: [55.846608, 48.501120], name: 'Зеленодольск'},
    {coords: [55.756670, 52.054460], name: 'Елабуга'},
    {coords: [50.322058, 44.801319], name: 'Котово'},
    {coords: [54.599028, 52.442667], name: 'Лениногорск'},
    {coords: [55.298984, 52.006391], name: 'Заинск'},
    {coords: [56.222926, 51.074937], name: 'Вятские Поляны'},
    {coords: [54.859808, 53.074533], name: 'Азнакаево'},
    {coords: [54.406333, 53.245896], name: 'Бавлы'},
    {coords: [55.719972, 53.101429], name: 'Мензелинск'},
    {coords: [55.723293, 54.049816], name: 'село Актаныш'},
    {coords: [55.258997, 52.592650], name: 'село Сарманово'},
    {coords: [55.428695, 51.413710], name: 'пос. Камские Поляны'},
    {coords: [55.304534, 53.189994], name: 'село Муслюмово'},
    
    // Центральный федеральный округ
    {coords: [55.755814, 37.617635], name: 'Москва'},
    
    {coords: [51.661535, 39.200287], name: 'Воронеж'},
    {coords: [54.193033, 37.617752], name: 'Тула'},
    {coords: [53.243325, 34.363731], name: 'Брянск'},
    {coords: [57.000348, 40.973921], name: 'Иваново'},
    {coords: [56.859611, 35.911896], name: 'Тверь'},
    {coords: [56.129042, 40.407030], name: 'Владимир'},
    {coords: [54.782640, 32.045134], name: 'Смоленск'},
    {coords: [52.970143, 36.063397], name: 'Орёл'},
    {coords: [52.721246, 41.452238], name: 'Тамбов'},
    {coords: [55.579169, 42.052411], name: 'Муром'},
    {coords: [56.713217, 36.779309], name: 'Конаково'},
    {coords: [53.278939, 36.575006], name: 'Мценск'},
    {coords: [54.002146, 37.517626], name: 'Щёкино'},
    {coords: [52.337971, 35.351743], name: 'Железногорск'},
    {coords: [53.770093, 38.122551], name: 'Богородицк'},
    {coords: [50.595660, 36.587223], name: 'Белгород'},
    
    // Южный федеральный округ
    {coords: [47.222513, 39.718669], name: 'Ростов-на-Дону'},
    {coords: [48.707103, 44.516939], name: 'Волгоград'},
    {coords: [45.057626, 38.992615], name: 'Краснодар'},
    {coords: [43.585525, 39.723062], name: 'Сочи'},
    {coords: [48.786293, 44.751867], name: 'Волжский'},
    {coords: [47.209580, 38.935194], name: 'Таганрог'},
    {coords: [47.424600, 40.086349], name: 'Новочеркасск'},
    {coords: [47.516545, 42.198423], name: 'Волгодонск'},
    {coords: [47.757738, 39.936430], name: 'Новошахтинск'},
    {coords: [46.308309, 44.270181], name: 'Элиста'},
    {coords: [44.095640, 39.073553], name: 'Туапсе'},
    {coords: [44.894997, 37.316259], name: 'Анапа'},
    {coords: [44.934412, 37.985495], name: 'Крымск'},
    {coords: [44.563022, 38.079055], name: 'Геленджик'},
    {coords: [48.176977, 40.803340], name: 'Белая Калитва'},
    {coords: [45.213631, 39.691198], name: 'Усть-Лабинск'},
    {coords: [44.634425, 39.135563], name: 'Горячий Ключ'},
    {coords: [44.412303, 39.531981], name: 'Хадыженск'},
    {coords: [46.533682, 41.032329], name: 'пос. Целина'},
    
    // Северо-Кавказский
    {coords: [45.044502, 41.969065], name: 'Ставрополь'},
    {coords: [44.039290, 43.070840], name: 'Пятигорск'},
    {coords: [44.781528, 44.165024], name: 'Будённовск'},
];

var openCities = [
    // Дальневосточный федеральный округ
    // Сибирский федеральный округ
    // Уральский федеральный округ
    // Северо-Западный федеральный округ
    {coords: [59.565155, 30.128165], name: 'Гатчина'},
    {coords: [59.727104, 30.408422], name: 'Пушкин'},
    {coords: [59.880396, 29.906560], name: 'Петергоф'},
    {coords: [59.644209, 33.542096], name: 'Тихвин'},
    
    // Приволжский
    {coords: [55.490345, 46.958156], name: 'пгт Вурнары'},
    {coords: [55.301495, 47.036058], name: 'пгт Ибреси'},
    {coords: [55.865010, 47.472980], name: 'Цивильск'},
    {coords: [55.715053, 51.412883], name: 'Мамадыш'},
    {coords: [54.599988, 53.695008], name: 'Туймазы'},
    {coords: [47.424600, 40.086349], name: 'Новочеркасск'},
    
    // Центральный федеральный округ
    // Южный федеральный округ
    // Северо-Кавказский
];

var newCities = [
    // Дальневосточный федеральный округ
    {coords: [44.162084, 133.269726], name: 'Арсеньев'},
    {coords: [51.999509, 127.676123], name: 'Шимановск'},
    {coords: [42.899915, 133.906532], name: 'пгт Преображение'},
    {coords: [50.263923, 130.266828], name: 'пгт Талакан'},
    {coords: [45.930850, 133.731738], name: 'Дальнереченск'},
    
    // Сибирский федеральный округ
    {coords: [52.033973, 113.499432], name: 'Чита'},
    {coords: [51.523073, 104.148725], name: 'Байкальск'},
    {coords: [51.907721, 102.434694], name: 'пос. Аршан'},
    {coords: [53.136911, 103.090096], name: 'Черемхово'},
    
    // Уральский федеральный округ
    
    // Северо-Западный федеральный округ
    {coords: [54.944006, 20.151512], name: 'Светлогорск'},
    {coords: [55.031649, 22.032386], name: 'Неман'},
    
    // {coords: [59.127447, 37.906956], name: 'Череповец'},
    
    // Приволжский
    {coords: [54.839816, 46.572195], name: 'Алатырь'},
    {coords: [56.222926, 51.074937], name: 'Вятские Поляны'},
    
    // Центральный федеральный округ
    // Южный федеральный округ
    // Северо-Кавказский
    
    // {coords: [], name: ''},
];

var inactiveCities = [
    // Дальневосточный федеральный округ
    // Сибирский федеральный округ
    // Уральский федеральный округ
    // Северо-Западный федеральный округ
    // Приволжский
    {coords: [54.536413, 52.789489], name: 'Бугульма'},
    
    // Центральный федеральный округ
    // Южный федеральный округ
    // Северо-Кавказский
    
    // {coords: [], name: ''},
];

console.log('Всего городов: ', activeCities.length + openCities.length + newCities.length);


var cityCategoties = [
    {name: 'active', cities: activeCities},
    {name: 'open', cities: openCities},
    {name: 'new', cities: newCities}
];


function placemark(city, group) {
    var preset;

    switch (group) {
        case 'active':
            // preset = 'islands#nightStretchyIcon';
            preset = 'islands#darkBlueStretchyIcon';
            break;
        case 'open':
            // preset = 'islands#darkBlueStretchyIcon';
            preset = 'islands#darkGreenStretchyIcon';
            break;
        case 'new':
            // preset = 'islands#lightBlueStretchyIcon';
            preset = 'islands#darkOrangeStretchyIcon';
            break;

    }

    return new ymaps.Placemark(
        city.coords,
        {iconContent: city.name},
        {preset: preset}
    );
}